package Set계열;

public class TreeSet_ {
	/*
	 * TreeSet은 이진탐색트리(binary search tree)라는 자료구조의 형태로
	 * 데이터를 저장하는 컬렉션 클래스이다.
	 *
	 * 이진 탐색 트리는 정렬, 검색, 범위검색에 높은 성능을 보이는 자료구조이며
	 * TreeSet은 이진 탐색 트리의 성능을 향상시킨 '레드-블랙 트리'로 구현되어 있다.
	 * 
	 * Set 인터페이스를 구현하였으므로 중복된 데이터의 저장을 허용하지 않으며,
	 * 정렬된 위치에 저장하므로 저장순서를 유지하지도 않는다.
	 *
	 * 이진트리는 linkedList처럼 여러 개의 node가 서로 연결된 구조로, 각 노드에 최대 2ㅐ개의
	 * 노드를 연결할 수 있으며, 루트라고 불리는 하나의 노드에서부터 시작해서
	 * 계속 확장해 나갈 수 있다.
	 * 
	 * 이진 탐색 트리는 이진 트리의 한 종류이다.
	 * 
	 * 위 아래로 연결된 두 노드를 부모-자식 관계에 있다고 하며 위의 노드를 부모노드,
	 * 아래의 노드를 자식 노드라고 한다.
	 * 
	 * 부모-자식 관계는 상대적인 것이며, 하나의 부모 노드는 최대 두 개의 자식 노드와 연결될 수 없다.
	 * 
	 * 이진 트리의 노드를 코드로 표현하면
	 * class TreeNode {
	 * 		TreeNode left; // 왼쪽 자식노드
	 * 	    object element; // 객체를 저장하기 위한 참조변수
	 *      TreeNode right; // 오른쪽 자식노드
	 * 
	 * }
	 * 
	 * 
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
